tutorials/heatSourceCalibration/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     additiveFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         <<endTime>>;

deltaT          1e-07;

writeControl    adjustableRunTime;

writeInterval   <<writeInterval>>;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDi           1;

maxAlphaCo      1;

functions
{
    meltPoolDimensions
    {
        libs ("libadditiveFoamFunctionObjects.so");
        
        type            meltPoolDimensions;
        enabled         true;
        
        scanPathAngle   0.0;
    }
}

// ************************************************************************* //
