tutorials/heatSourceCalibration/template/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources (beam);

beam
{
    pathName            scanPath;

    absorptionModel     Kelly;

    KellyCoeffs
    {
        eta0                0.27;
        etaMin              0.27;
        aspectRatioSwitch   0.0;
        geometry            cylinder;
    }

    heatSourceModel     projectedGaussian;

    projectedGaussianCoeffs
    {
        dimensions      (54.845e-6 54.845e-6 30.0e-6);
        A               0.0;
        B               <<B>>;

        transient       true;
        nPoints         (10 10 10);
    }
}

refinementModel
{
    refinementModel         targetCellLoad;
    
    refinementTemperature   1000;

    buffers
    {
        beam                (100.0e-6 100.0e-6 600e-6);
    }

    targetCellLoadCoeffs
    {
        targetCellsPerProc  5000;
        nBufferVolumes      4;
        maxSearchIter       10;
        timeTolerance       1e-4;
    }
}

// ************************************************************************* //
